<!doctype html><html lang="zh-CN"><head><meta charset="utf-8">

<!-- Prefetch -->
<link rel="preconnect" href="https://fonts.googleapis.com/" crossorigin>
<link rel="dns-prefetch" href="https://fonts.googleapis.com/">
<link rel="dns-prefetch" href="https://cdn.jsdelivr.net/">

<!-- Meta -->
<title>&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x5B66;&#x4E60; | Memory-copy</title>

<meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">

<!-- Google fonts -->
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Lobster&amp;display=swap&amp;text=Memory-copy0123456789">
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Inconsolata&amp;display=swap">
<link rel="shortcut icon" href="/assets/favicon.ico"><link rel="icon" type="image/png" sizes="16x16" href="/assets/favicon-16x16.png"><link rel="icon" type="image/png" sizes="32x32" href="/assets/favicon-32x32.png"><link rel="icon" type="image/png" sizes="48x48" href="/assets/favicon-48x48.png"><link rel="manifest" href="/assets/manifest.json"><meta name="mobile-web-app-capable" content="yes"><meta name="theme-color" content="#7f9cf5"><meta name="application-name" content="Memory-copy"><link rel="apple-touch-icon" sizes="57x57" href="/assets/apple-touch-icon-57x57.png"><link rel="apple-touch-icon" sizes="60x60" href="/assets/apple-touch-icon-60x60.png"><link rel="apple-touch-icon" sizes="72x72" href="/assets/apple-touch-icon-72x72.png"><link rel="apple-touch-icon" sizes="76x76" href="/assets/apple-touch-icon-76x76.png"><link rel="apple-touch-icon" sizes="114x114" href="/assets/apple-touch-icon-114x114.png"><link rel="apple-touch-icon" sizes="120x120" href="/assets/apple-touch-icon-120x120.png"><link rel="apple-touch-icon" sizes="144x144" href="/assets/apple-touch-icon-144x144.png"><link rel="apple-touch-icon" sizes="152x152" href="/assets/apple-touch-icon-152x152.png"><link rel="apple-touch-icon" sizes="167x167" href="/assets/apple-touch-icon-167x167.png"><link rel="apple-touch-icon" sizes="180x180" href="/assets/apple-touch-icon-180x180.png"><link rel="apple-touch-icon" sizes="1024x1024" href="/assets/apple-touch-icon-1024x1024.png"><meta name="apple-mobile-web-app-capable" content="yes"><meta name="apple-mobile-web-app-status-bar-style" content="black-translucent"><meta name="apple-mobile-web-app-title" content="Memory-copy"><meta name="msapplication-TileColor" content="#1a202c"><meta name="msapplication-TileImage" content="/assets/mstile-144x144.png"><meta name="msapplication-config" content="/assets/browserconfig.xml"><script defer="defer" src="/build/runtime.4f81b965ee044866d74b.js"></script><script defer="defer" src="/build/app.c495528d022cb4af101d.js"></script><link href="/build/app.c495528d022cb4af101d.css" rel="stylesheet"><meta name="generator" content="Hexo 5.4.0"><link rel="alternate" href="/atom.xml" title="Memory-copy" type="application/atom+xml">
</head><body class="bg-background text-content antialiased scrollbar-dark"><div class="container max-w-3xl mx-auto px-4 flex flex-col min-h-screen"><div class="flex-grow">
<header>
  <nav class="flex py-4 justify-end items-center">
    <a class="ml-5 text-content text-opacity-75 hover:text-accent" href="/about/">About</a><a class="ml-5 text-content text-opacity-75 hover:text-accent" href="/archives/">Archives</a>
    <div class="w-2"></div>
    
      <a class="header-icon-btn rss" title="RSS" href="/atom.xml"></a>
    
      <a class="header-icon-btn github" title="GitHub" target="_blank" rel="noopener" href="https://github.com/andytimes"></a>
    
  </nav>
  <h1 class="flex-shrink-0 font-logo text-white text-5xl leading-none text-right pb-12">
    <a href="/">Memory-copy</a>
  </h1>
</header>
 <main>
  

<article id="post-programming-language" class="article-container" itemscope itemtype="https://schema.org/Article">
  <header class="article-header">
    <div class="text-accent leading-none pb-2 text-sm">Jan 29, 2017</div>
    <h1 class="text-2xl lg:text-3xl font-light leading-tight pt-2" itemprop="headline">
      <a class="block hover:text-accent" href="/blog/2017/01/29/programming-language/">&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x5B66;&#x4E60;</a>
    </h1>
  </header>
  <div class="article-body" itemprop="articleBody">
    <p>&#x8FD9;&#x51E0;&#x5929;&#x6709;&#x70B9;&#x65E0;&#x804A;&#xFF0C;&#x5C31;&#x968F;&#x4FBF;&#x5199;&#x70B9;&#x4EC0;&#x4E48;&#x5427;&#x3002;</p>
<p>&#x63D0;&#x4E00;&#x4E0B;&#xFF0C;&#x76EE;&#x524D;&#x6211;&#x5728;&#x8FD9;&#x513F;&#x5199;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x9762;&#x5411;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#xFF0C;&#x5185;&#x5BB9;&#x591A;&#x548C;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x76F8;&#x5173;&#xFF0C;&#x89C1;&#x8C05;&#x3002;</p>
<span id="more"></span>
<p>&#x89C9;&#x5F97;&#x5B66;&#x4E60;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5FAA;&#x5E8F;&#x6E10;&#x8FDB;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8BA4;&#x771F;&#x5730;&#x4E00;&#x6B65;&#x6B65;&#x8D70;&#x4E0B;&#x53BB;&#xFF0C;&#x6E10;&#x6E10;&#x5730;&#x5C31;&#x4F1A;&#x6709;&#x6240;&#x6536;&#x83B7;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x597D;&#x4E45;&#x6CA1;&#x5199; C++ &#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x8FD9;&#x51E0;&#x5929;&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#x628A; C++ Primer &#x62FF;&#x51FA;&#x6765;&#x6E29;&#x4E60;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x4E5F;&#x628A; Effictive C++ 3th &#x770B;&#x4E86;&#x4E00;&#x904D;&#x3002;&#x611F;&#x60F3;&#x5C31;&#x662F;&#x5728;&#x7406;&#x89E3;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x72EC;&#x6709;&#x601D;&#x60F3;&#x4E4B;&#x524D;&#xFF0C;&#x662F;&#x5F88;&#x96BE;&#x53D1;&#x6325;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x5F3A;&#x5927;&#x529B;&#x91CF;&#xFF0C;&#x4E5F;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x8FD0;&#x4F5C;&#x7684;&#x3002;&#x770B;&#x5230;&#x81EA;&#x5DF1; 16 &#x5E74;&#x6691;&#x5047;&#x524D;&#x671F;&#x5199;&#x7684;&#x90A3;&#x51E0;&#x6BB5; C++ &#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x6B63;&#x597D;&#x8BC1;&#x5B9E;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x8FD9;&#x6B21;&#x9605;&#x8BFB;&#x7B97;&#x662F;&#x5C0F;&#x6709;&#x6536;&#x83B7;&#xFF0C;&#x5BF9; C++ &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684; is-a &#x548C; has-a &#x4E5F;&#x4E0D;&#x518D;&#x56F0;&#x60D1;&#x4E86;&#xFF0C;&#x4E3E;&#x4E2A;&#x6709;&#x5173; is-a &#x6982;&#x5FF5;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="language-cpp">class Person {
public:
	void eat();
private:
// ...
};

class Student : public Person {
public:
	void doHomework();
private:
// ...
};
</code></pre>
<p>&#x516C;&#x6709;&#x7EE7;&#x627F; (public inheritance) &#x8981;&#x5C55;&#x73B0;&#x51FA; is-a (&#x662F;&#x4E00;&#x79CD;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;) &#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x6E05;&#x6670;&#x7684;&#x5C55;&#x793A;&#xFF1A;&#x201C;&#x5B66;&#x751F;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x201D;&#xFF0C;&#x201C;&#x5B66;&#x751F;&#x201D;&#x53EF;&#x4EE5;&#x505A;&#x201C;&#x4EBA;&#x201D;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6BD4;&#x5982;&#x201C;&#x4EBA;&#x201D;&#x9700;&#x8981;&#x5403;&#x996D;&#xFF0C;&#x201C;&#x5B66;&#x751F;&#x201D;&#x4E5F;&#x9700;&#x8981;&#x5403;&#x996D;&#x3002;&#x4F46;&#x53CD;&#x8FC7;&#x6765;&#x5C31;&#x4E0D;&#x5FC5;&#x6EE1;&#x8DB3;&#xFF0C;&#x201C;&#x5B66;&#x751F;&#x201D;&#x8981;&#x5199;&#x4F5C;&#x4E1A;&#xFF0C;&#x4F46;&#x5E76;&#x975E;&#x6240;&#x6709;&#x7684;&#x201C;&#x4EBA;&#x201D;&#x90FD;&#x8981;&#x5199;&#x4F5C;&#x4E1A;&#x3002;&#x6240;&#x4EE5; <code>class Student</code> &#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F; <code>class Person</code> &#x7684;&#x7279;&#x5316;&#x7248;&#x672C;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5C55;&#x793A;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x822C;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x903B;&#x8F91;&#xFF0C;&#x5176;&#x5B9E;&#x6709;&#x4E9B;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x5728;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x6E05;&#x6670;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x70B9;&#x53CD;&#x76F4;&#x89C9;&#xFF0C;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x8981;&#x6C42;&#x7CBE;&#x786E;&#x65E0;&#x6B67;&#x4E49;&#xFF0C;&#x800C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x505A;&#x5230;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x9519;&#x7684;&#x505A;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x4FDD;&#x8BC1;&#x7EE7;&#x627F;&#x81EA;&#x57FA;&#x7C7B; (base class) &#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x90FD;&#x80FD;&#x5728;&#x6D3E;&#x751F;&#x7C7B; (derived class) &#x4E0A;&#x6B63;&#x786E;&#x65E0;&#x8BEF;&#x5730;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x907F;&#x514D;&#x8BBE;&#x8BA1;&#x51FA;&#x9519;&#x8BEF;&#x7684;&#x7EE7;&#x627F;&#x4F53;&#x7CFB;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x804A;&#x4E86; C++ &#x7684;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x7A0D;&#x5FAE;&#x63D0;&#x4E00;&#x4E0B;&#x591A;&#x91CD;&#x7EE7;&#x627F; (multiple inheritance)&#xFF0C;&#x56E0;&#x4E3A;&#x53BB;&#x5E74;&#x6691;&#x5047;&#x5199;&#x7684;&#x90A3;&#x51E0;&#x6BB5; C++ &#x4E5F;&#x7528;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x3002;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x662F;&#x6D3E;&#x751F;&#x7C7B;&#x542B;&#x6709;&#x591A;&#x4E2A;&#x57FA;&#x7C7B;&#x7684;&#x7EE7;&#x627F;&#x4F53;&#x7CFB;&#x3002;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x4F1A;&#x6BD4;&#x5355;&#x4E00;&#x7EE7;&#x627F;&#x7684;&#x903B;&#x8F91;&#x66F4;&#x590D;&#x6742;&#xFF0C;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x5FD8;&#x8BB0;&#x521D;&#x59CB;&#x5316;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x3002;&#x800C;&#x4E14;&#x5728;&#x7EE7;&#x627F;&#x4F53;&#x7CFB;&#x5185;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x91CD;&#x590D;&#x7EE7;&#x627F;&#xFF0C;&#x8FD8;&#x9700;&#x5F15;&#x5165;&#x865A;&#x7EE7;&#x627F;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x6240;&#x4EE5;&#x9664;&#x975E;&#x60C5;&#x51B5;&#x9002;&#x7528;&#xFF0C;&#x5426;&#x5219;&#x6700;&#x597D;&#x4E0D;&#x53BB;&#x4F7F;&#x7528;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x8BF4;&#x4E00;&#x53E5;&#x8001;&#x751F;&#x5E38;&#x8C08;&#x7684;&#x8BDD;&#xFF1A;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x591A;&#x7EC3;&#x3002;<br>
&#x5728;&#x7EC3;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6162;&#x6162;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x6E05;&#x695A;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FD9;&#x65F6;&#x518D;&#x53BB;&#x67E5;&#x9605;&#x76F8;&#x5173;&#x8D44;&#x6599;&#xFF0C;&#x7591;&#x60D1;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x89E3;&#x51B3;&#x4E86;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x51E0;&#x5E74;&#x524D;&#x5199; C &#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x6BD4;&#x8F83;&#x6726;&#x80E7;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48; inline &#x51FD;&#x6570;&#x548C;&#x7ED3;&#x6784;&#x4F53; (struct) &#x53EF;&#x4EE5;&#x653E;&#x5934;&#x6587;&#x4EF6;&#x91CC;&#xFF1F;&#x6307;&#x9488;&#x6307;&#x5411;&#x7684;&#x5730;&#x5740;&#x4E0E;&#x6307;&#x9488;&#x7684;&#x5730;&#x5740;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x8FD8;&#x6709;&#x6307;&#x5411;&#x6307;&#x9488; (pointer) &#x7684;&#x6307;&#x9488;&#x7684;&#x53D6;&#x503C;&#x53D6;&#x5740;&#x3002;&#x4F46;&#x8FD9;&#x4E9B;&#x90FD;&#x5728;&#x7EC3;&#x4E60;&#x4E2D;&#x6162;&#x6162;&#x6E05;&#x6670;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8981;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#xFF0C;&#x5149;&#x770B;&#x4E66;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x884C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x591A;&#x6570;&#x4E66;&#x7C4D;&#x9650;&#x4E8E;&#x7BC7;&#x5E45;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x53EA;&#x662F;&#x4E00;&#x8BED;&#x5E26;&#x8FC7;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x5B9E;&#x8DF5;&#x5F97;&#x51FA;&#x7684;&#x7ED3;&#x8BBA;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x8DB3;&#x591F;&#x6DF1;&#x523B;&#x3002;&#x53BB;&#x5199;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x770B;&#x770B;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x6162;&#x6162;&#x5730;&#xFF0C;&#x4E00;&#x5207;&#x5C31;&#x4F1A;&#x6E05;&#x6670;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x53EA;&#x662F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5B66;&#x4F1A;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x4E00;&#x5B9A;&#x80FD;&#x5199;&#x51FA;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x5728;&#x9002;&#x7528;&#x7684;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x8BA9;&#x4F7F;&#x7528;&#x8005;&#x66F4;&#x52A0;&#x5F97;&#x5FC3;&#x5E94;&#x624B;&#x3002;</p>
<p>&#x5C31;&#x8FD9;&#x6837;&#x5427;&#x3002;</p>

  </div>
  
  <footer class="article-footer">
    
      <ul class="list-none flex flex-wrap justify-end">
        <li class="pl-2">
            <a class="text-sm text-accent hover:underline" href="/tags/%E7%A8%8B%E5%BA%8F%E8%AE%BE%E8%AE%A1/">#&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;</a>
          </li><li class="pl-2">
            <a class="text-sm text-accent hover:underline" href="/tags/%E7%BC%96%E7%A8%8B%E8%AF%AD%E8%A8%80/">#&#x7F16;&#x7A0B;&#x8BED;&#x8A00;</a>
          </li>
      </ul>
      <meta itemprop="keywords" content=",">
    
  </footer>
  <meta itemprop="datePublished" content="2017-01-29T21:00:00.000Z">
  <meta itemprop="dateModified" content="2022-03-26T20:42:57.382Z">
  <div itemprop="author publisher" itemscope itemtype="https://schema.org/Person">
    <meta itemprop="name" content="Andy Deng">
  </div>
</article>

</main>


</div><div class="flex-shrink-0"><footer class="py-12 text-center">
  &#xA9; 2022 Andy Deng<br>
  Powered by <a class="hover:text-accent hover:underline" href="https://hexo.io/" target="_blank" rel="noopener">Hexo</a>
</footer>
</div></div></body></html>